/*
  МУИС-МТЭС 2024 он
  Даараах функцүүдийг зааврын дагуу хэрэгжүүлнэ. Ингэхдээ дараах санамжийг анхаараарай.
  САНАМЖ:
    * ЗӨВХӨН ЗААВРЫН ДАГУУ ХЭРЭГЖҮҮЛНЭ. Заавар жишээг сайтар харан хэрэгжүүлнэ үү.
    * ХЭВЛЭ ГЭЖ ЗААГААГҮЙ Л БОЛ ХЭВЛЭХ ҮЙЛДЭЛ ХИЙЖ БОЛОХГҮЙ.
    * ХҮСНЭГТ АШИГЛАХГҮЙ, БҮТЭЦ АШИГЛАХГҮЙ, ГЛАБАЛ ХУВЬСАГЧ ЗАРЛАХГҮЙ. ХУВААХ ҮЙЛДЭЛ, ҮЛДЭГДЭЛТЭЙ ХУВААХ ҮЙЛДЭЛ АШИГЛАХГҮЙ.
 */


#include "ops.h"

/*
  n тооны хамгийн хамгийн чухал биш битийг буцаана.
  Чухал биш бит гэдэг нь 2-ийн 0 зэрэг дээр байгаа бит болно.
  Жишээ нь n=13 гэвэл хоёртын бичиглэлд 00...01101 болох
  бөгөөд 1-ийг буцаана. Харин n=14 үед 0-ийг буцаана.
 */
int p1(int n)
{

        return (n&1);
}
/*
  n тооны хамгийн хамгийн чухал битийг буцаана.
  Чухал бит гэдэг w бит тооны хувьд 2-ийн w-1 зэрэг дээр байгаа
  бит болно. Ө.х тэмдэгтийн битийг буцаана.
  Жишээ нь n=13 үед хоёртын бичиглэлд 00...01101 болох
  бөгөөд 0-ийг буцаана. Харин n=-14 үед хоёртын бичиглэлд 111..110001
  болох бөгөөд 1-ийг буцаана.
 */
int p2(int n)
{
        return (n<0);          
}
/*
  n тооны к-р битийг буцаана.
  Жишээ нь n=13 үед хоёртын бичиглэлд 00...01101 болох ба
  k=0 үед 1, k=1 үед 0-ийг тус тус буцаана.
 */
int p3(int n, int k)
{
        
        return (n>>k)&1;
}
/*
  n тооны к-р битийг 1 болгосон утгыг буцаана.
  Жишээ нь n=13 үед хоёртын бичиглэлд 00...01101 болох ба
  k=1 үед 1-р битийг 1 болгоход хоёртын бичиглэл 00...01111
  болох ба 15 утгыг буцаана.
 */
int p4(int n, int k)
{       
        return n|(1<<k);
}
/*
  n тооны к-р битийг эсрэгээр солисны дараах утгыг буцаана.
  Жишээ нь n=13 үед хоёртын бичиглэлд 00...01101 болох ба
  k=1 үед 1-р битийг эсрэгээр солиход хоёртын бичиглэл 00...01111
  болох ба 15 утгыг буцаана.
  k=0 үед 0-р битийг эсрэгээр солиход хоёртын бичиглэл 00...01100
  болох ба 12 утгыг буцаана.
 */
int p5(int n, int k)
{
       return n^(1<<k);
}
/*
  n тооны хамгийн эхэнд олдох 1 утгатай бит хэд дүгээр бит болохыг буцаана.
  Жишээ нь n=12 үед хоёртын бичиглэлд 00...01100 болох ба 2-ийг буцаана.
  n=7 үед хоёртын бичиглэлд 00...000111 болох ба 0 утгыг буцаана.
  Хэрэв тийм бит олдохгүй бол -1 буцаана.
 */
int p6(int n)
{
        if (n==0) return -1;
        int l=0;
        while(!(n&1)){
                n =n>>1;
                l++;
        }
        return l;
}
/*
  n тооны хамгийн сүүлд олдох 1 утгатай бит хэд дүгээр бит болохыг буцаана.
  Жишээ нь n=-1 үед хоёртын бичиглэлд 11...111 болох ба 31-ийг буцаана.
  n=7 үед хоёртын бичиглэлд 00...000111 болох ба 2 утгыг буцаана.
  Хэрэв тийм бит олдохгүй бол -1 буцаана.
 */
int p7(int n)
{       if (n == 0) return -1;
        int l=31;
        while(!(n & 2147483648)){
                n=n<<1;
                l--;
        }
        return l;
}
/*
  n тооны хоёртын бичиглэлийн хойноос хэдэн 0 утгатай бит дарааллан байгааг буцаана.
  Жишээ нь n=7 үед хоёртын бичиглэлд 00...0111 болох ба 0-ийг буцаана.
  n=8 үед хоёртын бичиглэлд 00...001000 болох ба 3 утгыг буцаана.
 */
int p8(int n)
{       
        if (n == 0) return 32;
        int l=0;
        while(!(n & (1 << l))){
                l++;
        }
        return l;
}
/*
  n тооны хоёртын бичиглэлийн урдаас хэдэн 0 утгатай бит дарааллан байгааг буцаана.
  Жишээ нь n=7 үед хоёртын бичиглэлд 00...0111 болох ба 29-ийг буцаана.
  n=8 үед хоёртын бичиглэлд 00...001000 болох ба 28 утгыг буцаана.
 */
int p9(int n)
{
        if (n==0) return 32;
        int l=31;
        while(!(n & (1 << l))){
                l--;
        }
                return  31-l;

}
/*
  n тооны хоёртын бичиглэлийн бүх битийг эсрэгээр нь солин буцаана.
  Жишээ нь n=-1 үед хоёртын бичиглэлд 11...11 болох ба эсрэгээр солисны дараа 00..00 болж 0 утгыг буцаана.
  n=7 үед хоёртын бичиглэлд 00...000111 болох ба эсрэгээр солисны дараа 11..11000 болж -8 утгыг буцаана.
 */
int p10(int n)
{
        return ~n;
}
/*
  n тооны хоёртын бичиглэлийг хэвлэн харуул.
  Жишээ нь n=13 үед
  00000000 00000000 00000000 00001101
  гэж хэвлэнэ. БАЙТ БҮРИЙН ХООРОНД ЯГ НЭГ ХООСОН ЗАЙ АВАХЫГ АНХААРНА УУ!
  Хамгийн сүүлд шинэ мөрөөр төгсгөнө.
 */     
void p11(int n)
{       
        for (int i = 3; i>= 0; i--) {
                char l = (n >> (i * 8)) & 0xFF;
                for(int j = 7; j >= 0; j--){
                        printf("%d", (l >> j) & 1);
                }
                printf(" ");
        }
        printf("\n"); // Энэ мөрийг арилгахгүй.
}
/*
  n тоо өгөгдөхөд битийг нь к удаа тойргон шифт хийгээд гарсан утгыг буцаана.
  Жишээ нь өгөгдсөн n=14233615 тооны битийн бичиглэл нь
  0000 0000 1101 1001 0011 0000 0000 1111
  ийм бол к=8 удаа тойргон шифт хийсний дараа
  0000 1111 0000 0000 1101 1001 0011 0000
  болох бөгөөд 251713840 утгыг буцаана.
 */
int p12(int n, int k)
{
        k = k&31;
        if (k==0) return n;
        unsigned int un = (unsigned int)n;
        return (un >> k) | (un << (32-k));
}
